Tekla Open API Reference for Tekla Structures 2025
BooleanPart.BooleanTypeEnum Enumeration
 Defines the boolean operation: an add or a cut.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum BooleanTypeEnum
Public Enumeration BooleanTypeEnum
Members
Member name | Value | Description
BOOLEAN_ADD | 1 |  Defines the add part. Typically the add part type is not used.
BOOLEAN_CUT | 2 |  Defines the cut part.
BOOLEAN_WELDPREP | 3 |  Defines the weld prep part.
See Also
Reference
Tekla.Structures.Model Namespace